/*
	============================================
	chapter3. C프로그램 구성요소 
	2022-03-11
	=============================================
*/

#define _CRT_SECURE_NO_WARNINGS



// 3.4 함수
int hello(void) {


	return 0;
}


// 3.5 변수
// - 변수 이름짓기, 좋은 변수 이름
// - 변수 초기화

int x;
int y, z;

float f;
double d;

short s;

char c;


// 3.6 수식과 연산
// - 변수에 값 저장하기(대입연산자)
// - 산술연산



// 3.7 printf()
// - 문자열 출력
// - 변수 값 출력
// - 사칙연산


// 3.8 scanf()


// 3.9 덧셈 프로그램
// - 사용자로부터 2개의 정수를 받아서 더한 값을 출력하라!
// - 반지름을 입력받아 원의 넓이를 구해서 출력하라! (모두 실수형)

